[{
    "_id": "5e0992b3c008c3479e911f66",
    "name": "jokes",
    "type": "top",
    "value": "Boy complains to his father: You told me to put a potato in my swimming trunks! You said it would impress the girls at the pool! But you forgot to mention one thing! - Father: Really, what? - Boy: That the potato should go in the front."
  },
  {
    "_id": "5e09c23adf4b4b77e0459b6d",
    "name": "jokes",
    "type": "top",
    "value": "One company owner asks another: “Tell me, Bill, how come your employees are always on time in the mornings?”"
  },
  {
    "_id": "5e09c27245cf62787c108955",
    "name": "jokes",
    "type": "top",
    "value": "A wife is like a hand grenade. Take off the ring and say good bye to your house"
  },
  {
    "_id": "5e0a13664778b46014bbd4e2",
    "name": "jokes",
    "type": "top",
    "value": "Wait for me honey, I’m just finishing my make-up. -You don’t need make-up, Jane. -Oh, Richard…. really? That is so sweet of you! -You need plastic surgery."
  },
  {
    "_id": "5e0a13e0d942346084546a23",
    "name": "jokes",
    "type": "top",
    "value": "“Daddy, what is an alcoholic?” - “Do you see those 4 trees, son? An alcoholic would see 8 trees.” - “Um, Dad – there are only 2 trees.”"
  },
  {
    "_id": "5e0a142ded388c6153b27c84",
    "name": "jokes",
    "type": "top",
    "value": "Doctor: Hello, did you come to see me with an eye problem? Patient: Wow, yes, how can you tell? Doctor: Because you came in through the window instead of the door.“"
  },
  {
    "_id": "5e0a149878a73062590bc858",
    "name": "jokes",
    "type": "top",
    "value": "I was sitting in a bar one day and two really large women came in, talking in an interesting accent. So I said, “Cool accent, are you two ladies from Ireland?” One of them snarled at me, “It’s Wales, dumbo!” So I corrected myself, “Oh, right, so are you two whales from Ireland?” That’s about as far as I remember."
  },
  {
    "_id": "5e0a153a8787c663396f883c",
    "name": "jokes",
    "type": "top",
    "value": "A woman comes home late in the night and goes quietly in the bedroom. To her surprise, she sees male and female feet peeking out from under the blanket. Shocked and raging, she gets her baseball bat and beats and beats until all movement stops. After that she goes into the living room and sees her husband laying on the sofa. He turns to her half asleep: 'Oh, you're home, darling. I'm afraid we have to sleep here tonight, my parents came for a surprise visit.'"
  },
  {
    "_id": "5e0a158a071e1f63c753c9a9",
    "name": "jokes",
    "type": "top",
    "value": "A naked women robbed a bank. Nobody could remember her face."
  },
  {
    "_id": "5e0a163b180e8e644d28be60",
    "name": "jokes",
    "type": "top",
    "value": "Doctor: “Well - Mrs. Smith, it would seem that you're pregnant.” -Mrs. Smith: “Sweet Jesus, that's wonderful, I'm pregnant?!” -Doctor: “I only said that it seems so. Here's our weight loss brochure.”"
  },
  {
    "_id": "5e0a165658fe8464ac963e37",
    "name": "jokes",
    "type": "top",
    "value": "Guest at a restaurant: “I refuse to eat this roast beef. Please call the manager! “ Waiter: “That’s no use. He won’t eat it either.”"
  },
  {
    "_id": "5e0a16c5a6456d65345ee278",
    "name": "jokes",
    "type": "top",
    "value": "I’m selling my talking parrot. Why? Because yesterday, the bastard tried to sell me."
  },
  {
    "_id": "5e0a16ed78b41f6573aa276a",
    "name": "jokes",
    "type": "top",
    "value": "Doctor: “Can you describe the snake that bit you?” - Patient: “Yes. It looked like an angry rope. “"
  },
  {
    "_id": "5e0a172d4fcc9f65be0e8872",
    "name": "jokes",
    "type": "top",
    "value": "Doctor says to his patient: 'You have cancer and Alzheimer.' - Patient: 'At least I don't have cancer.'"
  },
  {
    "_id": "5e0f1437fc9d4f0017f841dd",
    "name": "jokes",
    "type": "top",
    "value": "Teacher: 'Kids, what does the chicken give you?' -Student: 'Meat!' -Teacher: 'Very good! Now what does the pig give you?' -Student: 'Bacon!' -Teacher: 'Great! And what does the fat cow give you?' -Student: 'Homework!'"
  },
  {
    "_id": "5e0f163ddcda9a6f6e3cb970",
    "name": "jokes",
    "type": "top",
    "value": "A child asked his father, 'How were people born?' So his father said, 'Adam and Eve made babies, then their babies became adults and made babies, and so on.' The child then went to his mother, asked her the same question and she told him, 'We were monkeys then we evolved to become like we are now.' The child ran back to his father and said, 'You lied to me!' His father replied, 'No, your mom was talking about her side of the family.'"
  },
  {
    "_id": "5e0f1676ff6fc370d475f480",
    "name": "jokes",
    "type": "top",
    "value": "My friend thinks he is smart. He told me an onion is the only food that makes you cry, so I threw a coconut at his face."
  },
  {
    "_id": "5e0f16c52da797716098a1f2",
    "name": "jokes",
    "type": "top",
    "value": "What happens to a frog's car when it breaks down? It gets toad away."
  },
  {
    "_id": "5e0f171ec9c1ac71d2db6672",
    "name": "jokes",
    "type": "top",
    "value": "Q: Is Google male or female?  -A: Female, because it doesn't let you finish a sentence before making a suggestion."
  },
  {
    "_id": "5e0f17b73425f372f7ed2b3a",
    "name": "jokes",
    "type": "top",
    "value": "--Teacher: 'If I gave you 2 cats and another 2 cats and another 2, how many would you have?' --Johnny: 'Seven.' --Teacher: 'No, listen carefully... If I gave you two cats, and another two cats and another two, how many would you have?' --Johnny: 'Seven.' --Teacher: 'Let me put it to you differently. If I gave you two apples, and another two apples and another two, how many would you have?' --Johnny: 'Six.' --Teacher: 'Good. Now if I gave you two cats, and another two cats and another two, how many would you have?' --Johnny: 'Seven!' --Teacher: 'Johnny, where in the heck do you get seven from?!' --Johnny: 'Because I've already got a freaking cat!'"
  },
  {
    "_id": "5e0f184c9975e674af4c46d8",
    "name": "jokes",
    "type": "top",
    "value": "Kid 1: 'Hey, I bet you're still a virgin.' -Kid 2: 'Yeah, I was a virgin until last night .' -Kid 1: 'As if.' -Kid 2: 'Yeah, just ask your sister.' -Kid 1: 'I don't have a sister.' -Kid 2: 'You will in about nine months.'"
  },
  {
    "_id": "5e0f19183b5c597602e1bfea",
    "name": "jokes",
    "type": "top",
    "value": "Mr. and Mrs. Brown had two sons. One was 'name'd Mind Your Own Business & the other was 'name'd Trouble. One day the two boys decided to play hide and seek. Trouble hid while Mind Your Own Business counted to one hundred. Mind Your Own Business began looking for his brother behind garbage cans and bushes. Then he started looking in and under cars until a police man approached him and asked, 'What are you doing?' 'Playing a game,' the boy replied. 'What is your 'name'?' the officer questioned. 'Mind Your Own Business.' Furious the policeman inquired, 'Are you looking for trouble?!' The boy replied, 'Why, yes.'"
  },
  {
    "_id": "5e0f1945736e67765a5c003f",
    "name": "jokes",
    "type": "top",
    "value": "-Q: What did the duck say when he bought lipstick? -A: 'Put it on my bill.'"
  },
  {
    "_id": "5e0f197f7f40cb76b7d052fa",
    "name": "jokes",
    "type": "top",
    "value": "A blonde and a redhead have a ranch. They have just lost their bull. The women need to buy another, but only have $500. The redhead tells the blonde, 'I will go to the market and see if I can find one for under that amount. If I can, I will send you a telegram.' She goes to the market and finds one for $499. Having only one dollar left, she goes to the telegraph office and finds out that it costs one dollar per word. She is stumped on how to tell the blonde to bring the truck and trailer. Finally, she tells the telegraph operator to send the word 'comfortable.' Skeptical, the operator asks, 'How will she know to come with the trailer from just that word?' The redhead replies, 'She's a blonde so she reads slow: 'Come for ta bull.''"
  },
  {
    "_id": "5e0f19a41a8ccc770670bbf0",
    "name": "jokes",
    "type": "top",
    "value": "A teacher asked her students to use the word 'beans' in a sentence. 'My father grows beans,' said one girl. 'My mother cooks beans,' said a boy. A third student spoke up, 'We are all human beans.'"
  },
  {
    "_id": "5e0f19c3aa283c77468944f6",
    "name": "jokes",
    "type": "top",
    "value": "Reaching the end of a job interview, the Human Resources Officer asks a young engineer fresh out of the Massachusetts Institute of Technology, 'And what starting salary are you looking for?' The engineer replies, 'In the region of $125,000 a year, depending on the benefits package. The interviewer inquires, Well, what would you say to a package of five weeks vacation, 14 paid holidays, full medical and dental, company matching retirement fund to 50% of salary, and a company car leased every two years, say, a red Corvette?' The engineer sits up straight and says, Wow! Are you kidding?' The interviewer replies, Yeah, but you started it.'"
  },
  {
    "_id": "5e0f1d6f590f46068df75d37",
    "name": "jokes",
    "type": "top",
    "value": "A young blonde woman is distraught because she fears her husband is having an affair, so she goes to a gun shop and buys a handgun. The next day she comes home to find her husband in bed with a beautiful redhead. She grabs the gun and holds it to her own head. The husband jumps out of bed, begging and pleading with her not to shoot herself. Hysterically the blonde responds to the husband, 'Shut up...you're next!'"
  },
  {
    "_id": "5e0f1d9a39c2cc07185f2edc",
    "name": "jokes",
    "type": "top",
    "value": "I said to the Gym instructor 'Can you teach me to do the splits?' He said, 'How flexible are you?' I said, 'I can't make Tuesdays'"
  },
  {
    "_id": "5e0f1db479de700768bc752d",
    "name": "jokes",
    "type": "top",
    "value": "Police arrested two kids yesterday, one was drinking battery acid, the other was eating fireworks. They charged one - and let the other one off."
  },
  {
    "_id": "5e0f1e1991c20507df9b4d1f",
    "name": "jokes",
    "type": "top",
    "value": "I went to the doctors the other day and I said, 'Have you got anything for wind?' So he gave me a kite."
  },
  {
    "_id": "5e0f1e9c89b284092a17792f",
    "name": "jokes",
    "type": "top",
    "value": "There's two fish in a tank, and one says to the other 'How do you drive this thing?'"
  },
  {
    "_id": "5e0f1ecaff26a609dfcc2e4c",
    "name": "jokes",
    "type": "top",
    "value": "Slept like a log last night........ Woke up in the fireplace."
  },
  {
    "_id": "5e0f1eec5316d70a2ac66e23",
    "name": "jokes",
    "type": "top",
    "value": "A sandwich walks into a bar. The barman says 'Sorry we don't serve food in here'"
  },
  {
    "_id": "5e0f1f445a9c150ab523d638",
    "name": "jokes",
    "type": "top",
    "value": "I was in Tesco's and I saw this man and woman wrapped in a barcode. I said, 'Are you two an item?' "
  },
  {
    "_id": "5e0f1f72f69fc00af2758ba0",
    "name": "jokes",
    "type": "top",
    "value": "So I went to the Chinese restaurant and this duck came up to me with a red rose and says 'Your eyes sparkle like diamonds'. I said, 'Waiter, I asked for a-ROMATIC duck'."
  },
  {
    "_id": "5e0f1fe00c6b710b8a783e81",
    "name": "jokes",
    "type": "top",
    "value": "My phone will ring at 2 in the morning, and my wife'll look at me and go, 'Who's that calling at this time?' 'I don't know! If I knew that we wouldn't need the bloody phone!'"
  },
  {
    "_id": "5e0f200e323a040c14aba742",
    "name": "jokes",
    "type": "top",
    "value": "I've got a friend who's fallen in love with two school bags, he's bisatchel."
  },
  {
    "_id": "5e0f28628bbdeb1320998551",
    "name": "jokes",
    "type": "top",
    "value": "Nothing is foolpr"
  },
  {
    "_id": "5e0f28628bbdeb1320998552",
    "name": "jokes",
    "type": "top",
    "value": "I have a lot of jokes about unem"
  },
  {
    "_id": "5e0f29b1f2ca4719f5c7566e",
    "name": "jokes",
    "type": "top",
    "value": "It’s not who you know, it’s whom you know."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "It’s not who you know, it’s whom you know."
  }, {
    "name": "jokes",
    "type": "top",
    "value": "I have a lot of jokes about unemployed people but none of them work."
  }
]