[
  {
    "name": "jokes",
    "type": "top",
    "value": "Boy complains to his father: You told me to put a potato in my swimming trunks! You said it would impress the girls at the pool! But you forgot to mention one thing! - Father: Really, what? - Boy: That the potato should go in the front."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "One company owner asks another:  “Tell me, Bill, how come your employees are always on time in the mornings?”"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "A wife is like a hand grenade. Take off the ring and say good bye to your house"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Wait for me honey, I’m just finishing my make-up. -You don’t need make-up, Jane. -Oh, Richard…. really? That is so sweet of you! -You need plastic surgery."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "“Daddy, what is an alcoholic?” - “Do you see those 4 trees, son? An alcoholic would see 8 trees.” - “Um, Dad – there are only 2 trees.”"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Doctor: Hello, did you come to see me with an eye problem? Patient: Wow, yes, how can you tell? Doctor: Because you came in through the window instead of the door.“"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "I was sitting in a bar one day and two really large women came in, talking in an interesting accent. So I said, “Cool accent, are you two ladies from Ireland?” One of them snarled at me, “It’s Wales, dumbo!” So I corrected myself, “Oh, right, so are you two whales from Ireland?” That’s about as far as I remember."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "A woman comes home late in the night and goes quietly in the bedroom. To her surprise, she sees male and female feet peeking out from under the blanket. Shocked and raging, she gets her baseball bat and beats and beats until all movement stops. After that she goes into the living room and sees her husband laying on the sofa. He turns to her half asleep: ¨Oh, you´re home, darling. I¨m afraid we have to sleep here tonight, my parents came for a surprise visit. ¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "A naked women robbed a bank. Nobody could remember her face."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Doctor: “Well - Mrs. Smith, it would seem that you´re pregnant.” - Mrs.Smith: “Sweet Jesus, that´s wonderful, I¨m pregnant ? !”-Doctor : “I only said that it seems so.Here´s our weight loss brochure.”"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Guest at a restaurant: “I refuse to eat this roast beef. Please call the manager! “ Waiter: “That’s no use. He won’t eat it either.”"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "I’m selling my talking parrot. Why? Because yesterday, the bastard tried to sell me."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Doctor: “Can you describe the snake that bit you?” - Patient: “Yes. It looked like an angry rope. “"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Doctor says to his patient: ¨You have cancer and Alzheimer. ¨- Patient: ¨At least I don t h ve cancer.¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Teacher: ¨Kids, what does the chicken give you ?¨ -Student: ¨Meat!¨ -Teacher: ¨Very good!Now what does the pig give you ?¨ -Student: ¨Bacon! ¨-Teacher: ¨Great!And what does the fat cow give you ?¨ -Student: ¨Homework!¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "A child asked his father, ¨How were people born ?¨ So his father said, ¨Adam and Eve made babies, then their babies became adults and made babies, and so on. ¨The child then went to his mother, asked her the same question and she told him, ¨We were monkeys then we evolved to become like we are now. ¨The child ran back to his father and said, ¨You lied to me!¨His father replied, ¨No, your mom was talking about her side of the family. ¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "My friend thinks he is smart. He told me an onion is the only food that makes you cry, so I threw a coconut at his face."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "What happens to a frog´s car when it breaks down ? It gets toad away. "
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Q: Is Google male or female?  -A: Female, because it doesn´t let you finish a sentence before making a suggestion."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "--Teacher: ¨If I gave you 2 cats and another 2 cats and another 2, how many would you have ? ¨--Johnny: ¨Seven.¨--Teacher : ¨No, listen carefully... If I gave you two cats, and another two cats and another two, how many would you have?¨--Johnny: ¨Seven.¨--Teacher: ¨Let me put it to you differently. If I gave you two apples, and another two apples and another two, how many would you have?¨--Johnny: ¨Six. ¨--Teacher: ¨Good.Now if I gave you two cats, and another two cats and another two, how many would you have ? ¨--Johnny: ¨Seven!¨--Teacher : ¨Johnny, where in the heck do you get seven from?!¨--Johnny: ¨Because I¨ve already got a freaking cat!¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Kid 1: ¨Hey, I bet you´re still a virgin.¨-Kid 2: ¨Yeah, I was a virgin until last night .¨-Kid 1: ¨As if.¨-Kid 2: ¨Yeah, just ask your sister.¨-Kid 1: ¨I don´t have a sister.¨-Kid 2: ¨You will in about nine months.¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Mr. and Mrs. Brown had two sons. One was ¨name¨d Mind Your Own Business & the other was ¨name¨d Trouble. One day the two boys decided to play hide and seek. Trouble hid while Mind Your Own Business counted to one hundred. Mind Your Own Business began looking for his brother behind garbage cans and bushes. Then he started looking in and under cars until a police man approached him and asked, ¨What are you doing ? ¨¨Playing a game, ¨the boy replied. ¨What is your ¨name¨? ¨the officer questioned. ¨Mind Your Own Business. ¨Furious the policeman inquired, ¨Are you looking for trouble ? !¨The boy replied, ¨Why, yes. ¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "-Q: What did the duck say when he bought lipstick? -A: ¨Put it on my bill. ¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "A blonde and a redhead have a ranch. They have just lost their bull. The women need to buy another, but only have $500. The redhead tells the blonde, ¨I will go to the market and see if I can find one for under that amount.If I can, I will send you a telegram. ¨She goes to the market and finds one for $499. Having only one dollar left, she goes to the telegraph office and finds out that it costs one dollar per word. She is stumped on how to tell the blonde to bring the truck and trailer. Finally, she tells the telegraph operator to send the word ¨comfortable. ¨Skeptical, the operator asks, ¨How will she know to come with the trailer from just that word ? ¨The redhead replies, ¨She´s a blonde so she reads slow: ¨Come for ta bull. ¨¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "A teacher asked her students to use the word ¨beans ¨in a sentence. ¨My father grows beans, ¨said one girl. ¨My mother cooks beans, ¨said a boy. A third student spoke up, ¨We are all human beans. ¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Reaching the end of a job interview, the Human Resources Officer asks a young engineer fresh out of the Massachusetts Institute of Technology, ¨And what starting salary are you looking for ? ¨The engineer replies, ¨In the region of $125, 000 a year, depending on the benefits package. ¨The interviewer inquires, ¨Well, what would you say to a package of five weeks vacation, 14 paid holidays, full medical and dental, company matching retirement fund to 50 % of salary, and a company car leased every two years, say, a red Corvette ? ¨The engineer sits up straight and says, ¨Wow!Are you kidding ? ¨The interviewer replies, ¨Yeah, but you started it. ¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "A young blonde woman is distraught because she fears her husband is having an affair, so she goes to a gun shop and buys a handgun. The next day she comes home to find her husband in bed with a beautiful redhead. She grabs the gun and holds it to her own head. The husband jumps out of bed, begging and pleading with her not to shoot herself. Hysterically the blonde responds to the husband, ¨Shut up...you´re next!¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "I said to the Gym instructor ¨Can you teach me to do the splits ? ¨He said, ¨How flexible are you ? ¨I said, ¨I can´t make Tuesdays¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Police arrested two kids yesterday, one was drinking battery acid, the other was eating fireworks. They charged one - and let the other one off."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "I went to the doctors the other day and I said, ¨Have you got anything for wind ? ¨So he gave me a kite."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "There´s two fish in a tank, and one says to the other ¨How do you drive this thing ? ¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Slept like a log last night........ Woke up in the fireplace."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "A sandwich walks into a bar. The barman says ¨Sorry we don´t serve food in here¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "I was in Tesco´s and I saw this man and woman wrapped in a barcode. I said, ¨Are you two an item ? ¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "So I went to the Chinese restaurant and this duck came up to me with a red rose and says ¨Your eyes sparkle like diamonds ¨. I said, ¨Waiter, I asked for a - ROMATIC duck ¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "My phone will ring at 2 in the morning, and my wife´ll look at me and go, ¨Who´s that calling at this time?¨¨I don´t know!If I knew that we wouldn´t need the bloody phone!¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "I¨ve got a friend who´s fallen in love with two school bags, he´s bisatchel. "
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "It’s not who you know, it’s whom you know."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "I have a lot of jokes about unemployed people but none of them work."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "A boy asks his father, ¨Dad, are bugs good to eat ?¨ ¨That´s disgusting. Don´t talk about things like that over dinner,¨the dad replies. After dinner the father asks, ¨Now, son, what did you want to ask me?¨¨Oh, nothing, ¨the boy says. ¨There was a bug in your soup, but now it’ s gone. ¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "~Q: Why was six scared of seven? ~A: Because seven ate nine."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "~Q: Can a kangaroo jump higher than the Empire State Building? ~A: Of course. The Empire State Building can´t jump. "
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "~Q: Why did the witche´s team lose the baseball game ? ~A : Their bats flew away."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "A bus full of ugly people had a head on collision with a truck. When they died, God granted all of them one wish. The first person said, ¨I want to be gorgeous. ¨God snapped his fingers and it happened. The second person said the same thing and God did the same thing. This want on and on throughout the group. God noticed the last man in line was laughing hysterically. By the time God got to the last ten people, the last man was laughing and rolling on the ground. When the man¨s turn came, he laughed and said, ¨I wish they were all ugly again. ¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "~Q: Why couldn´t the leopard play hide and seek ? ~A : Because he was always spotted. "
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "In a Catholic school cafeteria, a nun places a note in front of a pile of apples, ¨Only take one.God is watching. ¨Further down the line is a pile of cookies. A little boy makes his own note, ¨Take all you want.God is watching the apples. ¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "~Q: Why couldn´t the blonde add 10 + 5 on a calculator ? ~A : She couldn´t find the¨10¨button."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Instead of ¨the John, ¨I call my toilet ¨the Jim. ¨That way it sounds better when I say I go to the Jim first thing every morning."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "~Q: What starts with E, ends with E, and has only 1 letter in it? ~A: Envelope."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Q: Did you hear about the kidnapping at school? ~A: It´s okay.He woke up. "
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "A husband and wife were driving through Louisiana. As they approached Natchitoches, they started arguing about the pronunciation of the town. They argued back and forth, then they stopped for lunch. At the counter, the husband asked the blonde waitress, ¨Before we order, could you please settle an argument for us ? Would you please pronounce where we are very slowly ? ¨She leaned over the counter and said, ¨Burrr - gerrr Kiiing. ¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "~Math Teacher: ¨If I have 5 bottles in one hand and 6 in the other hand, what do I have ? ¨~Student: ¨A drinking problem. ¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "~Q: Why did the can crusher quit his job? ~A: Because it was soda pressing."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Late one night a burglar broke into a house and while he was sneaking around he heard a voice say, ¨ Jesús is watching you. ¨He looked around and saw nothing. He kept on creeping and again heard, ¨ Jesús is watching you. ¨In a dark corner, he saw a cage with a parrot inside. The burglar asked the parrot, ¨ Was it you who said Jesús is watching me¨The parrot replied, ¨ Yes. ¨Relieved, the burglar asked, ¨ What is your ¨name¨? ¨The parrot said, ¨ Clarence. ¨The burglar said, ¨ That´s a stupid ¨name¨for a parrot. What idiot ¨name¨d you Clarence?¨The parrot answered, ¨The same idiot that ¨name¨d the rottweiler Jesús.¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "~Q: Why did Adele cross the road? ~A: To sing, ¨ Hello from the other side!¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "My friend told me he had the body of a Greek god. I had to explain to him that Buddha is not Greek."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "How is Christmas like your job? You do all the work and the fat guy in the suit gets all the credit."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "A proud and confident genius makes a bet with an idiot. The genius says, ¨ Hey idiot, every question I ask you that you don´t know the answer, you have to give me $5. And if you ask me a question and I can¨ t answer yours I will give you $5, 000. ¨The idiot says, ¨ Okay. ¨The genius then asks, ¨ How many continents are there in the world ? ¨The idiot doesn¨ t know and hands over the $5.The idiot says, ¨Now me ask: what animal stands with two legs but sleeps with three?¨ The genius tries and searches very hard for the answer but gives up and hands over the $5000.The genius says, ¨Dang it, I lost. By the way, what was the answer to your question?¨ The idiot hands over $5. "
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "~Teacher: ¨ Which book has helped you the most in your life ? ¨~Student: ¨ My father ¨s check book!¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Three dead men go to hell at the same time. There is a white man, a Chinese man, and a Mexican man. Satan tells them that they can only leave hell if he can¨ t do what they ask.The white man asks for the fastest sports car in the world;he goes to into hell.The Chinese man asks for the most advanced computer in the world;he goes into to hell.The Mexican man gets a glass soda bottle, farts into it, closes the lid, pokes many holes in the lid, and asks Satan which hole the fart came from.After pointing to every hole on the lid, the Mexican turns around, points at his butt hole, and says, ¨Nope, this one.¨ "
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "A mom texts, ¨ Hi!Son, what does IDK, LY, & TTYL mean ? ¨He texts back, ¨ I Don´t Know, Love You, & Talk To You Later.¨ The mom texts him, ¨It´s ok, don´t worry about it.I´ll ask your sister, love you too.¨ "
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "I was wondering why the ball kept getting bigger and bigger, and then it hit me."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "~Q: Can February march? ~A: No, but April may."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "There was this guy at a bar, just looking at his drink. He stays like that for a half hour. Then a big trouble making truck driver steps next to him, takes the drink from the guy, & just drinks it all down. The poor man starts crying. The truck driver says, ¨ Come on man, I was just joking.Here, I´ll buy you another drink. I just can¨ t stand to see a man cry. ¨¨ No, it´s not that,¨the man replies, wiping his tears, ¨This day is the worst of my life. First, I oversleep & I go in late to my office. My outraged boss fires me. When I leave the building to go to my car, I find out it was stolen. The police say they can do nothing. I get a cab to go home, & when I get out, I remember I left my wallet. The cab driver just drives away. I go inside my house where I find my wife in bed with the gardener. I leave my home, come to this bar, & just when I was thinking about putting an end to my life, you show up & drink my poison.¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Don´t break anybody¨s heart; they only have 1. Break their bones; they have 206."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Two guys are walking through a game park & they come across a lion that has not eaten for days. The lion starts chasing the two men. They run as fast as they can and the one guy starts getting tired and decides to say a prayer, ¨ Please turn this lion into a Christian, Lord. ¨He looks to see if the lion is still chasing and he sees the lion on its knees. Happy to see his prayer answered, he turns around and heads towards the lion. As he comes closer to the lion, he hears the it saying a prayer: ¨ Thank you Lord for the food I am about to receive. ¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "~Q: Why does Humpty Dumpty love autumn? ~A: Because Humpty Dumpty had a great fall."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "~A: I have the perfect son. ~B: Does he smoke? ~A: No, he doesn’t. ~B: Does he drink whiskey? ~A: No, he doesn’t. ~B: Does he ever come home late? ~A: No, he doesn’t. ~B: I guess you really do have the perfect son. How old is he? ~A: He will be six months old next Wednesday."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "~Q: What do you call a pig that does karate? ~A: A pork chop."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "A police officer attempts to stop a car for speeding and the guy gradually increases his speed until he´s topping 100 mph. The man eventually realizes he can¨ t escape and finally pulls over.The cop approaches the car and says, ¨It´s been a long day and my shift is almost over, so if you can give me a good excuse for your behavior, I¨ ll let you go. ¨The guy thinks for a few seconds and then says, ¨ My wife ran away with a cop about a week ago.I thought you might be that officer trying to give her back!¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "A man got hit in the head with a can of Coke, but he was alright because it was a soft drink."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "A bank robber pulls out gun points it at the teller, and says, ¨ Give me all the money or you´re geography!¨The puzzled teller replies, ¨Did you mean to say¨ or you´re history ? ¨¨ The robber says, ¨Don´t change the subject!¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "~Q: How do you make a tissue dance? ~A: Put a little boogie in it."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Brunette: ¨ Where were you born ? ¨~Blonde: ¨ The United States. ¨~Brunette: ¨ Which part ? ¨~Blonde: ¨ My whole body. ¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "A young boy came home from school and told his mother, ¨ I had a big fight with my classmate.He called me a sissy. ¨The mother asked, ¨ What did you do ?¨The boy replied, ¨ I hit him with my purse!¨"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "~Q: Why can¨ t you trust an atom ? ~A : Because they make up everything. "
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "~Q: What do computers eat for a snack? ~A: Microchips!"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Did you hear about the guy whose whole left side was cut off? He´s all right now. "
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "~Q: What´s the difference between a guitar and a fish ? ~A : You can tune a guitar, but you can´t tuna fish."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "~Q: Why did the fish blush? ~A: Because it saw the ocean´s bottom. "
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Why is it that your nose runs, but your feet smell?"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "¨THREE TREES AND A WOODPECKER¨  Two tall trees, a birch and a beech, are growing in the woods.A small tree begins to grow between them, and the beech says to the birch, ¨ Is that a son of a beech or a son of a birch ? ¨The birch says he cannot tell, but just then a woodpecker lands on the sapling. The birch says, ¨ Woodpecker, you are a tree expert.Can you tell if that is a son of a beech or a son of a birch ? ¨The woodpecker takes a taste of the small tree and replies, ¨ It is neither a son of a beech nor a son of a birch, It is, however, the best piece of ash I have ever poked my pecker into. ¨Now wipe that smile off your face."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "If Mary had Jesus, and Jesus is the lamb of God, does that mean Mary had a little lamb?"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "A guy goes in for a job interview and sits down with the boss. The boss asks him, “What do you think is your worst quality?” The man says “I’m probably too honest.” The boss says, “That’s not a bad thing, I think being honest is a good quality.” The man replies, “I don’t care about what you think!”"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "My memory has gotten so bad it has actually caused me to lose my job. I’m still employed. I just can’t remember where."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Some people say the glass is half full. Some people say the glass is half empty. Engineers say the glass is twice as big as necessary."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "I asked the corporate wellness officer, “Can you teach me yoga?” He said, “How flexible are you?” I said, “I can’t make Tuesdays.”"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "My boss says I have a preoccupation with vengeance. We’ll see about that."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "The reason we “nod off to sleep” is so it looks like we’re just emphatically agreeing with everything when we’re in a boring meeting."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "When an employment application asks who is to be notified in case of emergency, I always write, “A very good doctor”."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Team work is important; it helps to put the blame on someone else."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "I’m great at multitasking. I can waste time, be unproductive, and procrastinate all at once."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Nothing ruins a Friday more than an understanding that today is Tuesday."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "I can’t believe I got fired from the calendar factory. All I did was take a day off."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "I always tell new hires, don’t think of me as your boss, think of me as a friend who can fire you."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "My resumé is just a list of things I hope you never ask me to do."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "The proper way to use a stress ball is to throw it at the last person to upset you."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "There is a new trend in our office; everyone is putting ¨ name´s on their food. I saw it today, while I was eating a sandwich ¨ name¨d Kevin."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "My annual performance review says I lack “passion and intensity.” I guess management hasn’t seen me alone with a Big Mac."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "I get plenty of exercise – jumping to conclusions, pushing my luck, and dodging deadlines."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "How do construction workers party? They raise the roof."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "If every day is a gift, I’d like a receipt for Monday. I want to exchange it for another Friday."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Feeling stressed out? Make a nice cup of hot tea and then spill it in the lap of whoever’s bugging you."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "I use artificial sweetener at work. I add it to everything I say to my boss."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "A clean desk is a sign of a cluttered desk drawer."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "The only thing worse than seeing something done wrong is seeing it done slowly."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "If at first you don’t succeed, redefine success."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Give me ambiguity or give me something else."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "We have enough youth. How about a fountain of “Smart”?"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "I started out with nothing and I still have most of it."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "The boss frowns on anyone yelling: “Hey Weirdo!” He says too many people look up from their work."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Things really haven’t gotten worse. We’ve just improved our inter-departmental communication skills."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Anything that could possibly go wrong often does – as well as a thing or two that couldn’t possibly."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "If it wasn’t for the last minute, nothing would get done."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "If our boss makes a mistake, it is our mistake."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "A diplomat is someone who can tell you to go to hell in such a way that you will look forward to the trip."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "To steal ideas from one person is plagiarism. To steal from many is research."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "A bus station is where a bus stops. A train station is where a train stops. On my desk, I have a work station…"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "I like work. It fascinates me. I sit and look at it for hours."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "I’m out of bed and dressed. What more do you want?"
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "Experience is what you get when you didn’t get what you wanted."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "To be sure of hitting the target, shoot first and call whatever you hit the target."
  },
  {
    "name": "jokes",
    "type": "top",
    "value": "To err is human, to blame it on someone else shows management potential."
  }
]
